EccoB/MSP430_LoRaWAN/SPI-SX1276/transmitter/sx1276.c
#include <custom.h>
#include "def.h"
#include <math.h>
#include <msp430.h>
#include <string.h>
#include "mcu.h"
#include "spi.h"
#include "stdio.h"
#include <driverlib.h>
#include <sx1276.h>
#include <sx1276regs-fsk.h>
#include <sx1276regs-lora.h>

#ifdef SX1276_CHIP

//static RadioEvents_t *RadioEvents;
static uint8_t RxTxBuffer[RX_BUFFER_SIZE];
sx1276_t sx1276;


typedef struct {
    radio_modem_t Modem;
    uint8_t       Addr;
    uint8_t       Value;
} radio_registers_t;

const radio_registers_t radio_registers[] = {
    { MODEM_FSK , REG_LNA                , 0x23 },
    { MODEM_FSK , REG_RXCONFIG           , 0x1E },
    { MODEM_FSK , REG_RSSICONFIG         , 0xD2 },
    { MODEM_FSK , REG_AFCFEI             , 0x01 },
    { MODEM_FSK , REG_PREAMBLEDETECT     , 0xAA },
    { MODEM_FSK , REG_OSC                , 0x07 },
    { MODEM_FSK , REG_SYNCCONFIG         , 0x12 },
    { MODEM_FSK , REG_SYNCVALUE1         , 0xC1 },
    { MODEM_FSK , REG_SYNCVALUE2         , 0x94 },
    { MODEM_FSK , REG_SYNCVALUE3         , 0xC1 },
    { MODEM_FSK , REG_PACKETCONFIG1      , 0xD8 },
    { MODEM_FSK , REG_FIFOTHRESH         , 0x8F },
    { MODEM_FSK , REG_IMAGECAL           , 0x02 },
    { MODEM_FSK , REG_DIOMAPPING1        , 0x00 },
    { MODEM_FSK , REG_DIOMAPPING2        , 0x30 },
    { MODEM_LORA, REG_LR_PAYLOADMAXLENGTH, 0x40 },
};

typedef struct {
    uint32_t bandwidth;
    uint8_t  RegValue;
} fsk_bandwidth_t;

const fsk_bandwidth_t fsk_bandwidths[] = {
    { 2600  , 0x17 },
    { 3100  , 0x0F },
    { 3900  , 0x07 },
    { 5200  , 0x16 },
    { 6300  , 0x0E },
    { 7800  , 0x06 },
    { 10400 , 0x15 },
    { 12500 , 0x0D },
    { 15600 , 0x05 },
    { 20800 , 0x14 },
    { 25000 , 0x0C },
    { 31300 , 0x04 },
    { 41700 , 0x13 },
    { 50000 , 0x0B },
    { 62500 , 0x03 },
    { 83333 , 0x12 },
    { 100000, 0x0A },
    { 125000, 0x02 },
    { 166700, 0x11 },
    { 200000, 0x09 },
    { 250000, 0x01 },
    { 300000, 0x00 }, // Invalid Badwidth
};

char after_transmit[] = {0x92,0x08,0x81,0x80};

static radio_events_t* radio_events;

#define RF_MID_BAND_THRESH                          525000000

/*void readRegisters(){
    uint8_t RX = 0;
    char str[20];
    RX = sx1276_read(REG_FRFMSB);
    //sprintf(str, "REG_FRFMSB: %d", RX );
    //myUart_writeBuf( BACKCHANNEL_UART, (unsigned char *)str, NULL, CRLF );
    RX = sx1276_read(REG_FRFMID);
    //sprintf(str, "REG_FRFMID: %d", RX );
    //myUart_writeBuf( BACKCHANNEL_UART, (unsigned char *)str, NULL, CRLF );
    RX = sx1276_read(REG_FRFLSB);
    //sprintf(str, "REG_FRFLSB: %d", RX );
    //myUart_writeBuf( BACKCHANNEL_UART, (unsigned char *)str, NULL, CRLF );
    RX = sx1276_read(REG_OPMODE);
    //sprintf(str, "REG_OPMODE: %d", RX );
    //myUart_writeBuf( BACKCHANNEL_UART, (unsigned char *)str, NULL, CRLF );
}*/

#ifdef RFM95
static uint8_t sx1276_get_paselect(uint32_t channel) {
  if(channel < RF_MID_BAND_THRESH ) {
    return RF_PACONFIG_PASELECT_PABOOST;
  } else {
    return RF_PACONFIG_PASELECT_PABOOST;
  }
}
#endif

static uint8_t sx1276_get_fsk_bandwidthregvalue(uint32_t bandwidth) {
  uint8_t i = 0;
  for(i = 0; i < (sizeof(fsk_bandwidths) / sizeof(fsk_bandwidth_t)) - 1; i++) {
    if((bandwidth >= fsk_bandwidths[i].bandwidth) && (bandwidth < fsk_bandwidths[i + 1].bandwidth)) {
      return fsk_bandwidths[i].RegValue;
    }
  }
  // ERROR: Value not found
  //while(1);
  return 0;
}

void sx1276_init(radio_events_t* events) {
  uint8_t i = 0;

  radio_events = events;

  // Initialize driver timeout timers
  //TimerInit( &TxTimeoutTimer, SX1276OnTimeoutIrq );
  //TimerInit( &RxTimeoutTimer, SX1276OnTimeoutIrq );
  //TimerInit( &RxTimeoutSyncWord, SX1276OnTimeoutIrq );

  sx1275_reset();

  sx1276_rxchain_calibration();

  sx1276_set_opmode(RFLR_OPMODE_SLEEP);

  // Init IRQ interrupt for DIO0 = TXDone
  GPIO_setAsInputPinWithPullDownResistor(IRQ_PIN);          // IRQ pin
  GPIO_selectInterruptEdge(IRQ_PIN, GPIO_LOW_TO_HIGH_TRANSITION );
  GPIO_clearInterrupt(IRQ_PIN);
  GPIO_enableInterrupt(IRQ_PIN);

  __enable_interrupt();

  for(i = 0; i < sizeof(radio_registers) / sizeof(radio_registers_t); i++) {
    sx1276_set_modem(radio_registers[i].Modem);
    sx1276_write(radio_registers[i].Addr, radio_registers[i].Value);
  }

  sx1276_set_modem(MODEM_LORA);

  sx1276.Settings.State = RF_IDLE;
}

void sx1275_reset() {

    // Reset on P1.4
    mcu_delayms(1);

    GPIO_setAsOutputPin(SX_RESET_PIN);                             // Reset
    GPIO_setOutputLowOnPin(SX_RESET_PIN);

    mcu_delayms(10);

    GPIO_setOutputHighOnPin(SX_RESET_PIN);
    GPIO_setAsInputPin(SX_RESET_PIN);                             // Reset

    mcu_delayms(20);
}

void sx1276_rxchain_calibration() {
    uint8_t regPaConfigInitVal;
    uint32_t initialFreq;

    // Save context
    regPaConfigInitVal = sx1276_read(REG_PACONFIG);
    initialFreq = (double)(   ((uint32_t) sx1276_read(REG_FRFMSB) << 16) |
                              ((uint32_t) sx1276_read(REG_FRFMID) << 8 ) |
                              ((uint32_t) sx1276_read(REG_FRFLSB)      )) * (double) FREQ_STEP;

    // Cut the PA just in case, RFO output, power = -1 dBm
    sx1276_write(REG_PACONFIG, 0x00);

    // Launch Rx chain calibration for LF band
    sx1276_write(REG_IMAGECAL, (sx1276_read(REG_IMAGECAL) & RF_IMAGECAL_IMAGECAL_MASK) | RF_IMAGECAL_IMAGECAL_START);
    while((sx1276_read(REG_IMAGECAL) & RF_IMAGECAL_IMAGECAL_RUNNING) == RF_IMAGECAL_IMAGECAL_RUNNING) {
    }

    // Sets a Frequency in HF band
    sx1276_set_channel(868000000);

    // Launch Rx chain calibration for HF band
    sx1276_write(REG_IMAGECAL, (sx1276_read(REG_IMAGECAL) & RF_IMAGECAL_IMAGECAL_MASK) | RF_IMAGECAL_IMAGECAL_START);
    while((sx1276_read(REG_IMAGECAL) & RF_IMAGECAL_IMAGECAL_RUNNING) == RF_IMAGECAL_IMAGECAL_RUNNING) {
    }

    // Restore context
    sx1276_write(REG_PACONFIG, regPaConfigInitVal);
    sx1276_set_channel(initialFreq);
}

void sx1276_set_rxconfig(radio_modem_t modem, uint32_t bandwidth,
                         uint32_t datarate, uint8_t coderate,
                         uint32_t bandwidthAfc, uint16_t preambleLen,
                         uint16_t symbTimeout, bool fixLen,
                         uint8_t payloadLen,
                         bool crcOn, bool freqHopOn, uint8_t hopPeriod,
                         bool iqInverted, bool rxContinuous) {
  sx1276_set_modem(modem);

