EccoB/MSP430_LoRaWAN/SPI-SX1276/transmitter/sx1276.c
      // Symbol rate : time for one symbol (secs)
      double rs = bw / (1 << sx1276.Settings.LoRa.Datarate);
      double ts = 1 / rs;
      // time of preamble
      double tPreamble = (sx1276.Settings.LoRa.PreambleLen + 4.25) * ts;
      // Symbol length of payload and time
      double tmp = ceil((8 * pktLen - 4 * sx1276.Settings.LoRa.Datarate +
                           28 + 16 * sx1276.Settings.LoRa.CrcOn -
                           ( sx1276.Settings.LoRa.FixLen ? 20 : 0 ) ) /
                           ( double )( 4 * sx1276.Settings.LoRa.Datarate -
                           ( ( sx1276.Settings.LoRa.LowDatarateOptimize > 0 ) ? 2 : 0 ) ) ) *
                           ( sx1276.Settings.LoRa.Coderate + 4 );
      double nPayload = 8 + ( ( tmp > 0 ) ? tmp : 0 );
      double tPayload = nPayload * ts;
      // Time on air
      double tOnAir = tPreamble + tPayload;
      // return us secs
      airTime = floor( tOnAir * 1e3 + 0.999 );
    }
    break;
  }
  return airTime;
}

void sx1276_send(uint8_t *buffer, uint8_t size) {

	//Check for payload size:
	if(sx1276.Settings.LoRaPacketHandler.Size != size){
		sx1276_write(REG_LR_PAYLOADLENGTH, size); // Initializes the payload size
	}


  uint32_t txTimeout = 0;

  switch( sx1276.Settings.Modem ) {
    case MODEM_FSK: {
      sx1276.Settings.FskPacketHandler.NbBytes = 0;
      sx1276.Settings.FskPacketHandler.Size = size;

      if(sx1276.Settings.Fsk.FixLen == false) {
        sx1276_write_fifo((uint8_t*) &size, 1);
      } else {
        sx1276_write(REG_PAYLOADLENGTH, size);
      }

      if((size > 0) && (size <= 64)) {
        sx1276.Settings.FskPacketHandler.ChunkSize = size;
      } else {
        mcu_memcpy1(RxTxBuffer, buffer, size);
        sx1276.Settings.FskPacketHandler.ChunkSize = 32;
      }

      // Write payload buffer
      sx1276_write_fifo(buffer, sx1276.Settings.FskPacketHandler.ChunkSize);
      sx1276.Settings.FskPacketHandler.NbBytes += sx1276.Settings.FskPacketHandler.ChunkSize;
      txTimeout = sx1276.Settings.Fsk.TxTimeout;
    }
    break;
    case MODEM_LORA: {

#ifndef REDUCED
        if( sx1276.Settings.LoRa.IqInverted == true ) {
          //sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_ON));
          sx1276_write(REG_LR_INVERTIQ, 0x67); // InvertIQ Enabled (bit 6) | default_value (0x27) = 0x67
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_ON );
        } else {
          sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_OFF));
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_OFF );
        }

        // Initializes the payload size
        sx1276.Settings.LoRaPacketHandler.Size = size;
        sx1276_write(REG_LR_PAYLOADLENGTH, size);
#endif

      // Full buffer used for Tx
      sx1276_write(REG_LR_FIFOTXBASEADDR, 0);
      sx1276_write(REG_LR_FIFOADDRPTR, 0);      // Has to be sent every time: Sentbufferaddress, return to 0

      // FIFO operations can not take place in Sleep mode
#ifndef REDUCED
      if((sx1276_read(REG_OPMODE) & ~RF_OPMODE_MASK) == RF_OPMODE_SLEEP) {
        sx1276_set_opmode(RF_OPMODE_STANDBY);
        sx1276.Settings.State = RF_IDLE;

        mcu_delayms(10);
      }
#else
      sx1276_set_opmode(RF_OPMODE_STANDBY);
#endif

      sx1276.Settings.State = RF_IDLE;

#ifdef TIME_MEASUREMENT
      GPIO_toggleOutputOnPin(TM1_PIN);   // FIFO-Write Time
#endif
      // Write payload buffer
      sx1276_write_fifo( buffer, size );

#ifdef TIME_MEASUREMENT
      GPIO_toggleOutputOnPin(TM1_PIN);   // FIFO-Write Time
#endif

      txTimeout = sx1276.Settings.LoRa.TxTimeout;
    }
    break;
  }
  sx1276_set_tx(txTimeout );

#ifdef TIME_MEASUREMENT
  GPIO_setOutputHighOnPin(TM2_PIN);   // Sending Time
#endif
}

void sx1276_set_rx(uint32_t timeout) {
  int8_t rxContinuous = false;

  switch( sx1276.Settings.Modem ) {
    case MODEM_FSK: {
      rxContinuous = sx1276.Settings.Fsk.RxContinuous;

      // DIO0=PayloadReady
      // DIO1=FifoLevel
      // DIO2=SyncAddr
      // DIO3=FifoEmpty
      // DIO4=Preamble
      // DIO5=ModeReady
      sx1276_write(REG_DIOMAPPING1, (sx1276_read(REG_DIOMAPPING1) & RF_DIOMAPPING1_DIO0_MASK &
                                                                     RF_DIOMAPPING1_DIO1_MASK &
                                                                     RF_DIOMAPPING1_DIO2_MASK) |
                                                                     RF_DIOMAPPING1_DIO0_00 |
                                                                     RF_DIOMAPPING1_DIO1_00 |
                                                                     RF_DIOMAPPING1_DIO2_11);

      sx1276_write(REG_DIOMAPPING2, (sx1276_read(REG_DIOMAPPING2) & RF_DIOMAPPING2_DIO4_MASK &
                                                                     RF_DIOMAPPING2_MAP_MASK) |
                                                                     RF_DIOMAPPING2_DIO4_11 |
                                                                     RF_DIOMAPPING2_MAP_PREAMBLEDETECT);

      sx1276.Settings.FskPacketHandler.FifoThresh = sx1276_read(REG_FIFOTHRESH) & 0x3F;

      sx1276_write(REG_RXCONFIG, RF_RXCONFIG_AFCAUTO_ON | RF_RXCONFIG_AGCAUTO_ON | RF_RXCONFIG_RXTRIGER_PREAMBLEDETECT);

      sx1276.Settings.FskPacketHandler.PreambleDetected = false;
      sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
      sx1276.Settings.FskPacketHandler.NbBytes = 0;
      sx1276.Settings.FskPacketHandler.Size = 0;
    }
    break;
    case MODEM_LORA: {
      if(sx1276.Settings.LoRa.IqInverted == true) {
          sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_ON | RFLR_INVERTIQ_TX_OFF));
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_ON);
      } else {
          sx1276_write(REG_LR_INVERTIQ, ((sx1276_read(REG_LR_INVERTIQ) & RFLR_INVERTIQ_TX_MASK & RFLR_INVERTIQ_RX_MASK) | RFLR_INVERTIQ_RX_OFF | RFLR_INVERTIQ_TX_OFF));
          sx1276_write(REG_LR_INVERTIQ2, RFLR_INVERTIQ2_OFF);
      }

      // ERRATA 2.3 - Receiver Spurious Reception of a LoRa Signal
      if(sx1276.Settings.LoRa.Bandwidth < 9) {
          sx1276_write(REG_LR_DETECTOPTIMIZE, sx1276_read(REG_LR_DETECTOPTIMIZE) & 0x7F );
          sx1276_write(REG_LR_TEST30, 0x00);
          switch(sx1276.Settings.LoRa.Bandwidth) {
            case 0: // 7.8 kHz
              sx1276_write( REG_LR_TEST2F, 0x48 );
              sx1276_set_channel(sx1276.Settings.Channel + 7.81e3 );
              break;
            case 1: // 10.4 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 10.42e3 );
              break;
            case 2: // 15.6 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 15.62e3 );
              break;
            case 3: // 20.8 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 20.83e3 );
              break;
            case 4: // 31.2 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 31.25e3 );
              break;
            case 5: // 41.4 kHz
              sx1276_write( REG_LR_TEST2F, 0x44 );
              sx1276_set_channel(sx1276.Settings.Channel + 41.67e3 );
              break;
            case 6: // 62.5 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
            case 7: // 125 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
            case 8: // 250 kHz
              //sx1276_write( REG_LR_TEST2F, 0x40 );
              break;
          }
      } else {
          sx1276_write(REG_LR_DETECTOPTIMIZE, sx1276_read(REG_LR_DETECTOPTIMIZE) | 0x80);
      }

