EccoB/MSP430_LoRaWAN/SPI-SX1276/transmitter/sx1276.c
void sx1276_write_buffer(uint8_t addr, uint8_t* data, uint8_t len) {
    if (len > 0) {
    spi_chipEnable();

    spi_transfer(addr | 0x80);  // TX FIFO starts in addr = 0x80
    while (len--) spi_transfer(*data++);

    spi_txready();

    spi_chipDisable();
  }
}

void sx1276_write_fifo(uint8_t *data, uint8_t len) {
  sx1276_write_buffer(0, data, len);
}

uint8_t sx1276_read(uint8_t addr) {
  spi_chipEnable();

  spi_transfer(addr & 0x7f);
  spi_transfer(0x00);

  uint8_t result = spi_buf;

  spi_chipDisable();

  return result;
}

void sx1276_read_buffer(uint8_t addr, uint8_t* data, uint8_t len) {
  if (len > 0) {
    spi_chipEnable();
    spi_transfer(addr & 0x7f);

    while (len--) {
      spi_transfer(0x00);
      *data++  = spi_buf;
    }

    spi_chipDisable();
  }
}

void sx1276_read_fifo(uint8_t *data, uint8_t len) {
  sx1276_read_buffer(0, data, len);
}

void sx1276_on_dio0irq() {
  volatile uint8_t irqFlags = 0;

  switch(sx1276.Settings.State) {
    case RF_RX_RUNNING:
      // // TimerStop( &RxTimeoutTimer );
      switch(sx1276.Settings.Modem) {
        case MODEM_FSK: {
          if(sx1276.Settings.Fsk.CrcOn == true) {
            irqFlags = sx1276_read( REG_IRQFLAGS2 );
            if((irqFlags & RF_IRQFLAGS2_CRCOK) != RF_IRQFLAGS2_CRCOK) {
              // Clear Irqs
              sx1276_write(REG_IRQFLAGS1, RF_IRQFLAGS1_RSSI | RF_IRQFLAGS1_PREAMBLEDETECT | RF_IRQFLAGS1_SYNCADDRESSMATCH);
              sx1276_write(REG_IRQFLAGS2, RF_IRQFLAGS2_FIFOOVERRUN);

              //TimerStop( &RxTimeoutTimer );

              if(sx1276.Settings.Fsk.RxContinuous == false) {
                //TimerStop( &RxTimeoutSyncWord );
                sx1276.Settings.State = RF_IDLE;
              } else {
                // Continuous mode restart Rx chain
                sx1276_write( REG_RXCONFIG, sx1276_read( REG_RXCONFIG ) | RF_RXCONFIG_RESTARTRXWITHOUTPLLLOCK );
                //TimerStart( &RxTimeoutSyncWord );
              }

              if((radio_events != 0) && (radio_events->RxError != 0) ) {
                  radio_events->RxError();
              }

              sx1276.Settings.FskPacketHandler.PreambleDetected = false;
              sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
              sx1276.Settings.FskPacketHandler.NbBytes = 0;
              sx1276.Settings.FskPacketHandler.Size = 0;
              break;
            }
          }

          // Read received packet size
          if((sx1276.Settings.FskPacketHandler.Size == 0) && (sx1276.Settings.FskPacketHandler.NbBytes == 0)) {
            if(sx1276.Settings.Fsk.FixLen == false) {
                sx1276_read_fifo((uint8_t*) &sx1276.Settings.FskPacketHandler.Size, 1);
            } else {
                sx1276.Settings.FskPacketHandler.Size = sx1276_read(REG_PAYLOADLENGTH);
            }
            sx1276_read_fifo(RxTxBuffer + sx1276.Settings.FskPacketHandler.NbBytes, sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
            sx1276.Settings.FskPacketHandler.NbBytes += (sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
          } else {
            sx1276_read_fifo(RxTxBuffer + sx1276.Settings.FskPacketHandler.NbBytes, sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
            sx1276.Settings.FskPacketHandler.NbBytes += (sx1276.Settings.FskPacketHandler.Size - sx1276.Settings.FskPacketHandler.NbBytes);
          }

          if(sx1276.Settings.Fsk.RxContinuous == false) {
            sx1276.Settings.State = RF_IDLE;
            //TimerStart( &RxTimeoutSyncWord );
          } else {
            // Continuous mode restart Rx chain
            sx1276_write(REG_RXCONFIG, sx1276_read(REG_RXCONFIG) | RF_RXCONFIG_RESTARTRXWITHOUTPLLLOCK);
          }
          //TimerStop( &RxTimeoutTimer );

          if((radio_events != 0) && (radio_events->RxDone != 0))   {
              radio_events->RxDone(RxTxBuffer, sx1276.Settings.FskPacketHandler.Size, sx1276.Settings.FskPacketHandler.RssiValue, 0);
          }

          sx1276.Settings.FskPacketHandler.PreambleDetected = false;
          sx1276.Settings.FskPacketHandler.SyncWordDetected = false;
          sx1276.Settings.FskPacketHandler.NbBytes = 0;
          sx1276.Settings.FskPacketHandler.Size = 0;
        }
        break;
        case MODEM_LORA: {
          int8_t snr = 0;

          // Clear Irq
          sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_RXDONE);

          irqFlags = sx1276_read(REG_LR_IRQFLAGS);
          if((irqFlags & RFLR_IRQFLAGS_PAYLOADCRCERROR_MASK) == RFLR_IRQFLAGS_PAYLOADCRCERROR) {
            // Clear Irq
            sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_PAYLOADCRCERROR);

            if(sx1276.Settings.LoRa.RxContinuous == false) {
              sx1276.Settings.State = RF_IDLE;
            }
            //TimerStop( &RxTimeoutTimer );

            if((radio_events != 0) && (radio_events->RxError != 0)) {
                radio_events->RxError();
            }

            break;
          }

          sx1276.Settings.LoRaPacketHandler.SnrValue = sx1276_read(REG_LR_PKTSNRVALUE);
          if(sx1276.Settings.LoRaPacketHandler.SnrValue & 0x80) { // The SNR sign bit is 1
            // Invert and divide by 4
            snr = ( ( ~sx1276.Settings.LoRaPacketHandler.SnrValue + 1 ) & 0xFF ) >> 2;
            snr = -snr;
          } else {
            // Divide by 4
            snr = ( sx1276.Settings.LoRaPacketHandler.SnrValue & 0xFF ) >> 2;
          }

          int16_t rssi = sx1276_read(REG_LR_PKTRSSIVALUE);
          if(snr < 0) {
            if(sx1276.Settings.Channel > RF_MID_BAND_THRESH) {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_HF + rssi + (rssi >> 4) + snr;
            } else {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_LF + rssi + (rssi >> 4) + snr;
            }
          } else {
            if(sx1276.Settings.Channel > RF_MID_BAND_THRESH) {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_HF + rssi + (rssi >> 4);
            } else {
              sx1276.Settings.LoRaPacketHandler.RssiValue = RSSI_OFFSET_LF + rssi + (rssi >> 4);
            }
          }

