EccoB/MSP430_LoRaWAN/SPI-SX1276/transmitter/sx1276.c
          sx1276.Settings.LoRaPacketHandler.Size = sx1276_read(REG_LR_RXNBBYTES);
          sx1276_read_fifo(RxTxBuffer, sx1276.Settings.LoRaPacketHandler.Size);

          if(sx1276.Settings.LoRa.RxContinuous == false) {
            sx1276.Settings.State = RF_IDLE;
          }
          //TimerStop( &RxTimeoutTimer );

          if((radio_events != 0) && (radio_events->RxDone != 0)) {
            radio_events->RxDone(RxTxBuffer, sx1276.Settings.LoRaPacketHandler.Size, sx1276.Settings.LoRaPacketHandler.RssiValue, sx1276.Settings.LoRaPacketHandler.SnrValue);
          }
        }
        break;
        default:
        break;
      }
    break;
    case RF_TX_RUNNING:
      //TimerStop( &TxTimeoutTimer );
      switch(sx1276.Settings.Modem) {
        case MODEM_LORA:
          // Clear Irq
          sx1276.Settings.State = RF_IDLE;
          sx1276_write(REG_LR_IRQFLAGS, RFLR_IRQFLAGS_TXDONE);
          sx1276_set_opmode(RFLR_OPMODE_SLEEP);
#ifndef REDUCED
          if((radio_events != 0) && (radio_events->TxDone != 0)) {
            radio_events->TxDone( );
          }
#endif
          break;

        case MODEM_FSK:
        default:
          sx1276.Settings.State = RF_IDLE;
          if((radio_events != 0) && (radio_events->TxDone != 0)) {
            radio_events->TxDone( );
          }
          break;
      }
    break;
    default:
    break;
  }
}

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=PORT1_VECTOR
__interrupt
#elif defined(__GNUC__)
__attribute__ ((interrupt(PORT1_VECTOR)))
#endif

void Port_1 (void) {

#ifdef TIME_MEASUREMENT
    GPIO_setOutputHighOnPin(TM1_PIN); // Wake Up Time
    GPIO_setOutputLowOnPin(TM2_PIN);  // Sending Time
#endif

    if(GPIO_getInterruptStatus(IRQ_PIN)){

        sx1276_on_dio0irq();

    }
    GPIO_clearInterrupt(IRQ_PIN);     // IRQ Flag

#ifdef TIME_MEASUREMENT
    GPIO_setOutputLowOnPin(TM1_PIN);  // Wake Up Time
#endif

}

#endif
